{
    "AuthenticationError":"Failed to authenticate cloud provider",
    "AccountAlreadyExists":"The specified account already exists",
    "AccountBeingCreated":"The specified account is in the process of being created",
    "AccountIsDisabled":"The specified account is disabled",
    "AuthenticationFailed":"Server failed to authenticate the request. Make sure the value of the Authorization header is formed correctly including the signature",
    "ConditionNotMet":"The condition specified in the conditional header(s) was not met for a write operation",
    "InsufficientAccountPermissions":"The account being accessed does not have sufficient permissions to execute this operation, Read or Write operations are not allowed",
    "InternalAPIError":"Azure server encountered an internal error. Please retry the request.Please try again after some time.",
    "InvalidAuthenticationInfo":"The authentication information was not provided in the correct format. Verify the value of Authorization header",
    "InvalidHttpVerb":"The HTTP verb specified was not recognized by the server",
    "InvalidInput":"One of the request inputs is not valid.",
    "InvalidQueryParameterValue":"An invalid value was specified for one of the query parameters in the request URI",
    "InvalidRange":"The range specified is invalid for the current size of the resource",
    "InvalidResourceName":"The specifed resource name contains invalid characters",
    "InvalidUri":"The requested URI does not represent any resource on the server",
    "MissingRequiredQueryParameter":"A required query parameter was not specified for this request",
    "MissingRequiredHeader":"A required HTTP header was not specified",
    "OperationTimedOut":"The operation could not be completed within the permitted time",
    "OutOfRangeInput":"One of the request inputs is out of range",
    "OutOfRangeQueryParameterValue":"A query parameter specified in the request URI is outside the permissible range",
    "RequestBodyTooLarge":"The size of the request body exceeds the maximum size permitted",
    "ResourceTypeMismatch":"The specified resource type does not match the type of the existing resource",
    "RequestUrlFailedToParse":"The url in the request could not be parsed.",
    "ResourceAlreadyExists":"The specified resource {name} already exists",
    "ResourceNotFound":"The specified resource {name} does not exist in {resourceGroup}, Please check cloud provider portal.",
    "ResourceGroupNotFound": "The specified resource {name} does not exist in {resourceGroup}, Please check cloud provider portal.",
    "NotFound": "The specified resource {name} does not exist",
    "ServerBusy":"The server is currently unable to receive requests. Please retry your request",
    "BundleError": "Internal Bundle Error, bundle zip does not have all required files",
    "InternalError": "Internal server encountered an internal error. Please retry the request.Please try again after some time",
    "ValidationError": "Mandatory parameters are missing.",
    "MandatoryParamsEmpty": "Required parameters are empty.",
    "PublicIpCreationError": "Unable to create public ip with given name",
    "AlreadyNICAssigned": "Already NIC {name} has assigned to other virtual machines",
    "PublicIPAddressInUse": "{publicip} address in use, Please give unique name. Please check cloud portal.",
    "VirtualNetworkMissing": "{name} unable to find Virtual Network",
    "DependencyError": "{name} tier has no dependency",
    "FirewallError":"Failed to create the firewall rule."
}
